# Row Filtering
In this notebook we will go over the basic concepts you need to know to filter rows (remove rows) based on the values on one or many of its columns

We will start by importing ```pandas``` and a function (```create_pd_table```) that creates the pandas table we will be using.

In [18]:
#Import pandas
import pandas as pd

#Import function
from help_pd_functions import create_pd_table

In the following block of code we create the table and print the first 5 lines. The table has 1000 rows in total and 4 columns:
* student_id
* exam_1
* exam_2
* exam_3

The table resembles the grades obtained by 1000 students in 3 exams.

In [20]:
#Create the table
data = create_pd_table()

#Print the table
data.head(5)

   student_id  exam_1  exam_2  exam_3
0           1       9       2       0
1           2       1      10       6
2           3      10       0       7
3           4       8       4       0
4           5       3       2       5

## Filtering base on one column
In the following block of code we create a new table containing only rows, where the value for ```exam_3``` is equal to 10. Then we print the first 5 rows of the new table.

In [21]:
#Create the table based on condition
bests_exams3 = data[data["exam_3"] == 10]

#Print table
bests_exams3.head(5)

    student_id  exam_1  exam_2  exam_3
7            8       3       4      10
8            9       4       5      10
10          11       9      10      10
13          14       5      10      10
18          19       4       8      10

The filtering took place in the first line: ```data[data["exam_3"] == 10]```.  Next we will make a third table filtering based on the value of 2 columns.

## Filtering based on two columns
For this example we will construct a table where the values for column **exam_1** and **exam_2** are both equal or less than 4